In [1]:
import pandas as pd

# might want to import Series and DataFrame too
#from pandas import Series, DataFrame

## Series

Series: https://wesmckinney.com/book/pandas-basics#pandas_series

Index Functions: https://wesmckinney.com/book/pandas-basics#tbl-table_index_methods

In [2]:
# pandas series
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
# the series has an index and an array
# the array is typically a numpy array
obj.index, '---', obj.array

(RangeIndex(start=0, stop=4, step=1),
 '---',
 <NumpyExtensionArray>
 [4, 7, -5, 3]
 Length: 4, dtype: int64)

In [9]:
# indexes can be specified too
# but indexes are immutable after creation
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2, '---', obj2.index

(d    4
 b    7
 a   -5
 c    3
 dtype: int64,
 '---',
 Index(['d', 'b', 'a', 'c'], dtype='object'))

In [14]:
# series are like dictionaries
# and can be created from a dictionary
# and then converted back to a dictionary
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3, '---', obj3.to_dict()

(Ohio      35000
 Texas     71000
 Oregon    16000
 Utah       5000
 dtype: int64,
 '---',
 {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000})

## DataFrame

DataFrame: https://wesmckinney.com/book/pandas-basics#pandas_dataframe

Constructors: https://wesmckinney.com/book/pandas-basics#tbl-table_dataframe_constructor

In [16]:
# pandas dataframe
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [18]:
# the head and tail methods will only show the top/bottom 5 rows
frame.head(), '---', frame.tail()

(    state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9,
 '---',
     state  year  pop
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2)

In [23]:
# columns can be accessed by dictionary like notation 
# or by dot attribute notation (as long as the attribute is valid and doesn't conflict)
frame['state'], '---', frame.year # can't do frame.pop for example

(0      Ohio
 1      Ohio
 2      Ohio
 3    Nevada
 4    Nevada
 5    Nevada
 Name: state, dtype: object,
 '---',
 0    2000
 1    2001
 2    2002
 3    2001
 4    2002
 5    2003
 Name: year, dtype: int64)

In [24]:
# you can add a series to a dataframe
s = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame['debt'] = s
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6  -1.2
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9  -1.5
5  Nevada  2003  3.2  -1.7